app/controllers/bookings_controller.rb

  def create
    @offer = Offer.find(params[:offer_id])
    @booking = Booking.new(booking_params)
    @booking.user = current_user
    @booking.offer = @offer

    if @booking.save
---
SELECT "offers".* FROM "offers" WHERE "offers"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "bookings" ("user_id", "offer_id", "pick_up_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["offer_id", 3], ["pick_up_time", "12-15hrs"], ["created_at", "2023-05-27 14:01:06.430421"], ["updated_at", "2023-05-27 14:01:06.430421"]]

  def show
    @booking = Booking.find(params[:id])
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]