app/controllers/offers_controller.rb

SELECT "offers".* FROM "offers" WHERE (offers.latitude IS NOT NULL AND offers.longitude IS NOT NULL)
---
  def index

    completed_ids = BookingStatus.where(completed: true).pluck(:booking_id)
    completed_bookings = Booking.where(id: completed_ids).pluck(:offer_id)
    @offers_active = Offer.where.not(id: completed_bookings )

SELECT "offers".* FROM "offers" WHERE "offers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @offer = Offer.find(params[:id])

SELECT "offers".* FROM "offers" ORDER BY "offers"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "offers" ("title", "body", "user_id", "address", "created_at", "updated_at", "longitude", "latitude", "pickupslots", "typeofoffer", "foodtype", "allergen") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @offer = Offer.new(offer_params)
    @offer.typeofoffer = params[:offer][:foodtype].reject{|el| el === ''}.join(',')
    @offer.pickupslots = params[:offer][:pickupslots].reject{|el| el === ''}.join(',')
    @offer.allergen = params[:offer][:allergen].reject{|el| el === ''}.join(',')
    @offer.user = current_user

    if @offer.save